#include "ImageWidget.h"



/*******************************  Start :ImageWidget  *********************************/

/***********************************************************************************
函数名称：ImageWidget

函数定义：构造函数

入口参数：

函数返回值：
***********************************************************************************/
ImageWidget::ImageWidget(QWidget *parent)
	: QWidget(parent)
{
	this->setMouseTracking(true);
}
/**********************************************************************************
函数名称：~ImageWidget

函数定义：析构函数

入口参数：

函数返回值：
***********************************************************************************/
ImageWidget::~ImageWidget()
{
}
/***********************************************************************************
函数名称：closeEvent

函数定义：窗口关闭事件

入口参数：QCloseEvent *event

函数返回值：
********************************************************************************/
void ImageWidget::closeEvent(QCloseEvent *event)
{
	QString  strTemp = this->windowTitle();
	emit ImgWidgetClose(strTemp);
}
/******************************  End :ImageWidget  ********************************/